<template>
  <div class="about-product">  
    <div class="row g-3"> <!-- mt-3 не подходит, т.к. получается отступ сверху - решил так  -->
      <div class="col-12 col-md-6"> <!-- на 576 px заезжает на друга сделал так -->

        <div class="about-product__title">
          {{ title }}
        </div>
        <div class="about-product__subtitle">
          {{ subTitle }}
        </div>

      </div>

      <div class="col-12 col-md-6"> <!-- mt-3 не подходит, т.к. получается отступ сверху -->
        <h3 class="about-product__equipment">Что в комплекте</h3>
        <div class="row g-3 mb-4">  <!-- почему не срабатывет row flex ? -->
          <div class="about-product__wrapper col-6">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="#5D6C7B" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M17.0821 2.26367H16.4973V16.6309C16.4973 17.5853 15.7204 18.3622 14.7659 18.3622H8.84069H4.12891V18.8948C4.12891 19.5047 4.62389 19.9997 5.23375 19.9997H11.1569H17.08C17.6899 19.9997 18.1849 19.5047 18.1849 18.8948V3.36852C18.1849 2.75866 17.692 2.26367 17.0821 2.26367Z"/>
              <path d="M8.84036 17.736H14.7635C15.3734 17.736 15.8684 17.241 15.8684 16.6312V2.26399V1.10485C15.8684 0.494987 15.3734 0 14.7635 0H8.84036H6.87085V0.365497C6.87501 0.403091 6.87712 0.442774 6.87712 0.482456V2.89056V3.50877C6.87712 4.36717 6.17954 5.06474 5.32114 5.06474H4.70293H2.29482C2.26349 5.06474 2.23008 5.06266 2.19875 5.06057H1.81445V16.6312C1.81445 17.241 2.30944 17.736 2.9193 17.736H4.13066H8.84036ZM9.06383 13.9808H5.20209C4.91387 13.9808 4.67995 13.7468 4.67995 13.4586C4.67995 13.1704 4.91387 12.9365 5.20209 12.9365H9.06592C9.35414 12.9365 9.58806 13.1704 9.58806 13.4586C9.58806 13.7468 9.35206 13.9808 9.06383 13.9808ZM12.9277 11.3158H5.20209C4.91387 11.3158 4.67995 11.0819 4.67995 10.7937C4.67995 10.5054 4.91387 10.2715 5.20209 10.2715H12.9277C13.2159 10.2715 13.4498 10.5054 13.4498 10.7937C13.4498 11.0819 13.2159 11.3158 12.9277 11.3158ZM5.20209 7.44152H12.9277C13.2159 7.44152 13.4498 7.67544 13.4498 7.96366C13.4498 8.25188 13.2159 8.4858 12.9277 8.4858H5.20209C4.91387 8.4858 4.67995 8.25188 4.67995 7.96366C4.67995 7.67544 4.91387 7.44152 5.20209 7.44152Z"/>
              <path d="M2.295 4.43905H5.32131C5.3234 4.43905 5.32758 4.43905 5.32967 4.43905C5.8351 4.43487 6.24445 4.02551 6.24863 3.52008C6.24863 3.518 6.24863 3.51382 6.24863 3.51173V0.483326C6.24863 0.20346 6.01889 0.0175781 5.78081 0.0175781C5.66594 0.0175781 5.55107 0.0593492 5.455 0.155423L1.96501 3.6454C1.67261 3.93779 1.87938 4.43905 2.295 4.43905Z"/>
            </svg>

            <div class="about-product__info">
              <div class="about-product__text">
                Инструкция
              </div>
              <div class="about-product__text_info">
                Посмотреть
              </div>
            </div>            
          </div>

          <div class="about-product__wrapper col-6">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="#5D6C7B" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M8.42715 6.13602H11.1218V4.96414H8.42715V2.53148H11.1218V1.35961H8.42715V0.626953H5.48633V6.86863H8.42715V6.13602Z"/>
              <path d="M4.31531 0H1.18945C0.542227 0 0.0175781 0.524648 0.0175781 1.17188V8.39625C0.0175781 9.04348 0.542227 9.56812 1.18945 9.56812H4.31531V0Z"/>
              <path d="M18.1528 14.2601H19.3246V3.46242C19.3246 1.55324 17.7714 0 15.8623 0C13.9531 0 12.3998 1.55324 12.3998 3.46242V14.1721C12.3998 16.7395 10.3112 18.8281 7.74387 18.8281C5.17656 18.8281 3.08789 16.7395 3.08789 14.1721V10.74H1.91602V14.1721C1.91602 17.3856 4.53035 20 7.74387 20C10.9574 20 13.5717 17.3856 13.5717 14.1721V3.46242C13.5717 2.19941 14.5993 1.17188 15.8623 1.17188C17.1253 1.17188 18.1528 2.19941 18.1528 3.46242V14.2601H18.1528Z"/>
              <path d="M17.498 15.4316V18.1358H18.1547V19.9997H19.3266V18.1358H19.9832V15.4316H17.498Z"/>
            </svg>

            <div class="about-product__info">
              <div class="about-product__text">
                Зарядное устройство
              </div> 
            </div>                    
          </div>

          <div class="about-product__wrapper col-6">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="#5D6C7B" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M18.0755 15.1236L16.9903 2.10085C16.9451 1.55976 16.7299 1.04691 16.3842 0.656637C16.009 0.233202 15.5248 0 15.0209 0H13.7656C13.4421 0 13.1797 0.262342 13.1797 0.585934C13.1797 0.909526 13.4421 1.17187 13.7656 1.17187H15.0209C15.3596 1.17187 15.772 1.59339 15.8225 2.19823L16.6911 12.6225C14.5174 12.9897 12.8421 14.7523 12.5861 16.9452H7.4137C7.12277 14.4749 5.0161 12.552 2.46881 12.552C1.72237 12.552 1.00428 12.7133 0.33464 13.0314C0.0423374 13.1703 -0.0820369 13.5198 0.0568295 13.8121C0.195657 14.1043 0.545186 14.2287 0.837489 14.0899C1.34878 13.847 1.89764 13.7238 2.46881 13.7238C4.36899 13.7238 5.94832 15.123 6.23097 16.9452H4.86668C4.6029 15.8659 3.62818 15.0624 2.46877 15.0624C1.10753 15.0624 0.000111089 16.1699 0.000111089 17.5311C0.000111089 18.8924 1.10753 19.9998 2.46877 19.9998C3.62818 19.9998 4.6029 19.1963 4.86668 18.117H13.138C13.4616 18.117 13.7239 17.8547 13.7239 17.5311C13.7239 15.6853 15.0311 14.1406 16.7888 13.7957L16.9012 15.1442C15.8442 15.4233 15.0625 16.3875 15.0625 17.5311C15.0625 18.8923 16.17 19.9998 17.5312 19.9998C18.8925 19.9998 20 18.8923 20 17.5311C20 16.3569 19.1757 15.3723 18.0755 15.1236Z"/>
            </svg>


            <div class="about-product__info">
              <div class="about-product__text">
                Чехол
              </div> 
            </div>                    
          </div>

          <div class="about-product__wrapper col-6">
            <svg 
              width="20" 
              height="20" 
              viewBox="0 0 20 20" 
              fill="#5D6C7B" 
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M20 10.0117L18.2883 7.78199L18.6712 5.01172L16.0586 3.97568L15.0225 1.36307L12.2523 1.74595L10 0.0117188L7.77027 1.72343L5 1.34055L3.96396 3.95316L1.35135 4.9892L1.73423 7.75947L0 10.0117L1.71171 12.2414L1.32883 15.0117L3.94144 16.0478L4.97748 18.6604L7.74775 18.2775L9.97748 19.9892L12.2072 18.2775L14.9775 18.6604L16.0135 16.0478L18.6261 14.9892L18.2432 12.2189L20 10.0117ZM9.18919 13.255L5.85586 10.5072L6.57658 9.62884L9.05405 11.6559L13.2883 6.76848L14.1441 7.51172L9.18919 13.255Z"/>
            </svg>

            <div class="about-product__info">
              <div class="about-product__text">
                Гарантийный талон
              </div> 
            </div>                    
          </div>
        </div>

        <h3 class="about-product__equipment">Ключевые особенности Kugoo Kirin M4</h3>


        <div class="row g-2 justify-content-start">
          <div class="col-auto">
            <ui-button
              title="Для города"
              bg-color="bg-grey-1"
              text-color="color-grey"
            />
          </div>
          <div class="col-auto">
            <ui-button
              title="Быстрый"
              bg-color="bg-grey-1"
              text-color="color-grey"

            />
          </div>
          <div class="col-auto">
            <ui-button
              title="Комфортный"
              bg-color="bg-grey-1"
              text-color="color-grey"

            />
          </div>
          <div class="col-auto">
            <ui-button
              title="Легкий"
              bg-color="bg-grey-1"
              text-color="color-grey"

            />
          </div>
        </div>

      </div>

    </div>
    


  </div>
  


</template>

<script>
import UiButton from '@/components/Ui/UiButton.vue'

  export default {
    name: 'MenuBottom',
    components: {
      UiButton
    },
    props: {
      title: {
        type: String,
        default: 'Электросамокат Kugoo Kirin M4 c мощными характеристиками и стильным дизайном'
      },
      subTitle: {
        type: String,
        default: 'Приобретая самокат Kugoo Kirin M4, вы получите множество положительных эмоций и сможете беспрепятственно передвигаться по городу. Самокат может набирать скорость до 45 км/ч благодаря усиленному мотор-колесу и батарее. Удобный дисплей позволяет легкостью отслеживать и переключать скорости передвижения, контролировать заряд аккумулятора, а также пройденный путь за все время и за текущую поездку в километрах.'
      }
    }
  }
</script>

<style lang="scss">
@import '@/assets/css/variables.scss';

.about-product {
  color: $black-1;
  line-height: normal;

  &__title {
    font-size: 25px;
    font-weight: 600;
    text-transform: uppercase;
    margin-bottom: 20px;
  }

  &__subtitle {
    font-size: 14px;
    font-weight: 400;
  }

  &__equipment {
    font-size: 20px;
    font-weight: 600;
    margin-bottom: 20px;
  }

  &__wrapper {
    display: flex;
    align-items: center;
  }

  &__info {
    display: flex;
    flex-direction: column;
    align-items: flex-start;
    justify-content: center;
    margin-left: 16px;
  }

  &__text {
    font-size: 14px;
    font-weight: 500;

    &_info {
      font-size: 12px;
      font-weight: 400;

      &:hover {
        color: $purple;
        cursor: pointer;
      }
    }
  }



}

</style>
